import Image from "next/image";

export default function Chairman() {
  return (
    <div className="container mx-auto mt-10 shadow-lg text-right bg-gray-200">
      <div className="flex">
        <div className="w-1/4">
          <Image src="/Chairman.png" alt="Image" width={250} height={250} />
          <p className="text-md text-center mt-2 font-bold">
            {" "}
            السيد / اسامة مخلوف{" "}
          </p>
        </div>
        <div className="w-3/4 mt-5 ">
          <div className="bg-gray-200 p-4 mt-4 w-fit ml-auto">
            <h1 className="text-4xl font-bold text-center pb-5">
              كلمة السيد / رئيس مجلس الادارة
            </h1>
            <p className="text-lg p-2">
              بناتي وأبنائي طلبة معهد المستقبل العالي للهندسة بالفيوم ..
            </p>
            <p className="text-lg p-2">
              يسعدني أن أرحب بكم وأهنئكم بالعام الدراسي الجديد ولاختياركم معهد
              المستقبل العالي للهندسة بالفيوم لإستكمال دراستكم الجامعية.
            </p>
            <p className="text-lg p-2">
              و أوصيكم أن تكونوا قدوة حسنة من حيث الخلق والوفاء والانتماء للمعهد
              والوطن. ونحن نفخر بأن معهد المستقبل العالي للهندسة بالفيوم قد تأسس
              علي تقاليد أكاديمية ويهدف إلي تأهيل الشباب علميا وشخصيا ويمنحكم
              المهارات اللازمة لتكونوا عنصراً فعالاً في أي مكان تتواجدون فيه
              فاحرصوا علي تلقي العلم والتفاعل في الأنشطة الطلابية حتى تكونوا
              عناصر منفردة متميزة مبدعة قادرة علي العطاء الآن ومستقبليا.
              واغتنموا سنوات الدراسة الجامعية لأنها ستكون مرجعكم وخزينتكم الثرية
              من المعلومات و الذكريات والعطاء.أنتم المستقبل وأنتم القادرون على
              النهوض بالوطن، وأود أن يدرك كل منكم أن عليه التزاما نحوه ونحو نفسه
              وأسرته وأن العلم هو سلاحنا للتقدم وأن الأخلاق طريق ما للحياة
              والتعايش . كما أتمنى أن يدرك كل منكم معنى الأمانة والإخلاص ويجب أن
              يعرف الجميع أننا سواسية نتميز بأعمالنا واجتهادنا.
            </p>
            <p className="text-lg p-2">
              أبنائي الأعزاء، نؤكد أنكم عنوانا للمعهد ولأنفسكم ونجاحكم نجاح
              للمعهد نتمنى أن يكون من بين خريجي معهد المستقبل العالي للهندسة
              بالفيوم علماء مميزون في مجالات تخصصهم يتشرف بهم المعهد وترتقي بهم
              مصر إلى تحقيق أهدافها المرجوة.
            </p>
            <p className="text-lg font-bold text-center">
              وفقكم الله وسدد خطاكم
            </p>
          </div>
        </div>
      </div>
    </div>
  );
} // Path: components/admin/dean.js
