import Image from "next/image";

export default function Dean() {
  return (
    <div className="container mx-auto mt-10 shadow-lg text-right bg-gray-200">
      <div className="flex">
        <div className="w-1/4 border-slate-600">
          <Image src="/dean.jpg" alt="Image" width={250} height={250} />
          <p className="text-md text-center mt-2 font-bold">
            {" "}
            الاستاذ الدكتور / محى الدين مصطفى
          </p>
        </div>
        <div className="w-3/4 mt-5 ">
          <div className="bg-gray-200 p-4 mt-4 w-fit ml-auto">
            <h1 className="text-4xl font-bold text-center pb-5">كلمة العميد</h1>
            <div className="bg-gray-100 p-4 mt-4 italic ">
              <p className="text-lg font-bold">بسم الله الرحمن الرحيم</p>
              <p className="text-lg">
                “قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا
                يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ“
              </p>
              <p className="text-sm">سورة الزمر (الآية 9)</p>
            </div>
            <p className="text-lg p-2">
              بهمس الكلمات ونور البسمة، أُرحِّب بأبناء الأمل، طلاب الفرقة
              الإعدادية الجدد في معهد المستقبل العالي للهندسة بالفيوم. أتمنى لكم
              رحلة دراسية مليئة بألوان الإبداع وروائع الاكتشاف، حيث يمتزج التحدي
              بالتفاني والعطاء.
            </p>
            <p className="text-lg p-2">
              في هذه البداية المشرقة، نقف كإدارة وهيئة تدريس بفخر واعتزاز، نعلن
              لكم بأنكم الأمل القادم واللبنة الأساسية في بناء مستقبل الهندسة
              والعلوم في وطننا الحبيب. إن معهدنا يعتبر موطنًا للعلم والإبداع،
              حيث تلتقي المعرفة بالأخلاق والتحصيل العلمي بالروح الرياضية.
            </p>
            <p className="text-lg p-2">
              طلابنا الأعزاء، لقد تم اختيار المقررات الدراسية بعناية فائقة، كي
              تتناغم مع تطلعات العصر وتحدياته. إن هدفنا الرئيسي هو تزويدكم
              بالمهارات التي تحتاجونها لتحقيق الابتكار والتميز في شتى مجالات
              الهندسة والتكنولوجيا.
            </p>
            <p className="text-lg p-2">
              في هذا السياق، أشد بتميزكم الأكاديمي والأخلاقي، فأنتم ليستم فقط
              طلابًا، بل روادًا يسعون لتحدي الصعاب بإرادة وعزيمة. إن تلاحمكم
              واحترامكم المتبادل يصنعان بيئة تعليمية فريدة، تنمي العقول وتنشر
              ثقافة العلم والاحتراف.
            </p>
            <p className="text-lg p-2">
              أدعوكم للاستفادة القصوى من فرص الاندماج في الحياة الطلابية، فربما
              هنا تكمن مفاتيح الابتكار والإلهام. لنكن جميعًا شركاء في بناء
              مستقبل مشرق، حيث يشع شبابنا بإشراق العلم والإبداع.
            </p>
            <p className="text-lg p-2">
              أخيرًا، أتمنى لكم عامًا دراسيًّا مليئًا بالنجاح والإنجازات، ولنكن
              دومًا نحو التميز والتألق.
            </p>
            <p className="text-lg font-bold text-center"> والله ولي التوفيق</p>
          </div>
        </div>
      </div>
    </div>
  );
} // Path: components/admin/dean.js
